# Apply 'n Combine

In [1]:
#Importing libraries
import pandas as pd
import numpy as np

In [2]:
#loading into a dataframe using pandas
data = pd.read_csv('file.csv',encoding='utf-8',sep=";")

In [3]:
#exploring the dataframe
data['Year_Month'].count()

329

In [4]:
#reading top 10 rows
data.head(10)

  Year_Month  BusinessUnit_ID           VL
0    2010/06                2     8562.500
1    2010/06                7     1632.500
2    2010/07                7        0.000
3    2010/07                2  1153650.225
4    2010/07                3    38434.250
5    2010/08                2  4633221.225
6    2010/08                3   258313.650
7    2010/08                7       85.000
8    2010/09                4  2882661.250
9    2010/09                7     6695.000

In [19]:
taxe = lambda x: x*0.1

In [20]:
#apply a function along any axis of the dataframe

data_taxes = data['VL'].apply(taxe)

In [21]:
#check some rows
data_taxes.head(10)

0       856.2500
1       163.2500
2         0.0000
3    115365.0225
4      3843.4250
5    463322.1225
6     25831.3650
7         8.5000
8    288266.1250
9       669.5000
Name: VL, dtype: float64

In [22]:
#Append new column
data['taxe']=data_taxes

In [23]:
#check new dataset
data.head(10)

  Year_Month  BusinessUnit_ID           VL         taxe
0    2010/06                2     8562.500     856.2500
1    2010/06                7     1632.500     163.2500
2    2010/07                7        0.000       0.0000
3    2010/07                2  1153650.225  115365.0225
4    2010/07                3    38434.250    3843.4250
5    2010/08                2  4633221.225  463322.1225
6    2010/08                3   258313.650   25831.3650
7    2010/08                7       85.000       8.5000
8    2010/09                4  2882661.250  288266.1250
9    2010/09                7     6695.000     669.5000